tonixtom/LPC1114-learning-routine/adc_lpc1114/adc_software/adc_start_lpc1114/CFG/adc.c
#include "lpc11xx.h"
#include "adc.h"


/*****************************************/
/* 函数名称：初始化ADC口                 */
/*****************************************/
void ADC_Init(uint8_t Channel)
{
	if(Channel>7) return;
	LPC_SYSCON->PDRUNCFG &= ~(0x1<<4);        // ADC模块上电
	LPC_SYSCON->SYSAHBCLKCTRL |= (1<<13);     // 使能ADC时钟
	LPC_SYSCON->SYSAHBCLKCTRL |= (1<<16);     // 使能IOCON时钟
	switch(Channel)
	{
		case 0: // 通道0配置 set channel 0
			LPC_IOCON->R_PIO0_11 &= ~0x07;              // 低3位清零
			LPC_IOCON->R_PIO0_11 |= 0x02;               // 把P0.11引脚设置为AD0功能
			LPC_IOCON->R_PIO0_11 &= ~(3<<3) ;           // MODE标志位清零，去掉上拉和下拉电阻
			LPC_IOCON->R_PIO0_11 &= ~(1<<7) ;           // ADMODE标志位清0，模拟输入模式
			break;
		case 1:  // 通道1配置 set channel 1
			LPC_IOCON->R_PIO1_0 &= ~0x07;              // 
			LPC_IOCON->R_PIO1_0 |= 0x02;               // 把P1.0引脚设置为AD1功能
			LPC_IOCON->R_PIO1_0 &= ~(3<<3) ;           // 去掉上拉和下拉电阻
			LPC_IOCON->R_PIO1_0 &= ~(1<<7) ;           // 模拟输入模式
			break;
		case 2:  // 通道2配置 set channel 2
			LPC_IOCON->R_PIO1_1 &= ~0x07;              // 
			LPC_IOCON->R_PIO1_1 |= 0x02;               // 把P1.1引脚设置为AD2功能
			LPC_IOCON->R_PIO1_1 &= ~(3<<3) ;           // 去掉上拉和下拉电阻
			LPC_IOCON->R_PIO1_1 &= ~(1<<7) ;           // 模拟输入模式
			break;
		case 3:  // 通道3配置 set channel 3
			LPC_IOCON->R_PIO1_2 &= ~0x07;              // 
			LPC_IOCON->R_PIO1_2 |= 0x02;               // 把P1.2引脚设置为AD3功能
			LPC_IOCON->R_PIO1_2 &= ~(3<<3) ;           // 去掉上拉和下拉电阻
			LPC_IOCON->R_PIO1_2 &= ~(1<<7) ;           // 模拟输入模式
			break;
		case 4:  // 通道4配置 set channel 4
			LPC_IOCON->SWDIO_PIO1_3 &= ~0x07;              // 
			LPC_IOCON->SWDIO_PIO1_3 |= 0x02;               // 把P1.3引脚设置为AD4功能
			LPC_IOCON->SWDIO_PIO1_3 &= ~(3<<3) ;           // 去掉上拉和下拉电阻
			LPC_IOCON->SWDIO_PIO1_3 &= ~(1<<7) ;           // 模拟输入模式
			break;
		case 5:  // 通道5配置 set channel 5
			LPC_IOCON->PIO1_4 &= ~0x07;              // 
			LPC_IOCON->PIO1_4 |= 0x01;               // 把P1.4引脚设置为AD5功能
			LPC_IOCON->PIO1_4 &= ~(3<<3) ;           // 去掉上拉和下拉电阻
			LPC_IOCON->PIO1_4 &= ~(1<<7) ;           // 模拟输入模式
			break;
		case 6:  // 通道6配置 set channel 6
			LPC_IOCON->PIO1_10 &= ~0x07;              // 
			LPC_IOCON->PIO1_10 |= 0x01;               // 把P1.10引脚设置为AD6功能
			LPC_IOCON->PIO1_10 &= ~(3<<3) ;           // 去掉上拉和下拉电阻
			LPC_IOCON->PIO1_10 &= ~(1<<7) ;           // 模拟输入模式
			break;
		case 7:  // 通道7配置 set channel 7
			LPC_IOCON->PIO1_11 &= ~0x07;              // 
			LPC_IOCON->PIO1_11 |= 0x01;               // 把P1.11引脚设置为AD7功能
			LPC_IOCON->PIO1_11 &= ~(3<<3) ;           // 去掉上拉和下拉电阻
			LPC_IOCON->PIO1_11 &= ~(1<<7) ;           // 模拟输入模式
			break;
		default:break;
	}
	LPC_SYSCON->SYSAHBCLKCTRL &= ~(1<<16);    // 关闭IOCON时钟
	LPC_ADC->CR = (1<<Channel)|                /* bit7:bit0   选择通道Channel*/
							(28<<8);                     /* bit15:bit8  把采样时钟频率设置为2MHz 58/(24+1)*/
}

/********************************************/
/* 函数功能：读取电压值（AD7）              */
/* 出口参数：adc_value, 读到的电压值        */
/********************************************/
uint32_t ADC_Read(uint8_t Channel)
{
	uint32_t adc_value=0;

	LPC_ADC->CR |= (1<<24); // 得用start标志位启动转换
	while((LPC_ADC->DR[Channel]&0x80000000)==0);
	adc_value = (LPC_ADC->DR[Channel]>>6)&0x3FF;	  //读取AD0DRn[15:6]中的值
	adc_value = (adc_value*Vref)/1024; // 转换为真正的电压值

	return adc_value;	  // 返回结果
}




//////////////////////////////////////////////////////////



